app/controllers/rsas_controller.rb

  def newKey
		if params.has_key?(:d) && params.has_key?(:e) && params.has_key?(:n)
			@rsa = Rsa.new({d:params[:d], e:params[:e], n:params[:n]})
		else
			arr = new_key()
			@rsa = Rsa.new({n:arr[0], e:arr[1], d:arr[2]})
		end
		p rsa
		@rsa.save
---
INSERT INTO "rsas" ("n", "e", "d", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["n", 1], ["e", 6], ["d", 5], ["created_at", "2018-01-14 22:18:38.952213"], ["updated_at", "2018-01-14 22:18:38.952213"]]

	def printKey
		@rsa = Rsa.find_by id:params[:id]
---
SELECT  "rsas".* FROM "rsas" WHERE "rsas"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]