app/controllers/rsas_controller.rb

  def create
    @rsa = Rsa.new(rsa_params)

    respond_to do |format|
      if @rsa.save
---
INSERT INTO "rsas" ("n", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["n", 3233], ["created_at", "2018-01-27 14:17:15.806487"], ["updated_at", "2018-01-27 14:17:15.806487"]]